# -*- coding: utf-8 -*-
## モデルから自由に変更可能クラス

module Kancolle
  class EntryFile < Kancolle::Model

    ##################################################################
    # イニシャライズ                                                 #
    ##################################################################
    def initialize
      super

      # @names = self.names
    end

    ##################################################################
    # インスタンスメソッド                                           #
    ##################################################################

    ##################################################################
    # end インスタンスメソッド                                       #
    ##################################################################

    private
    ## 艦隊の名前を返す
    # 例 { #{start_json_file} => [ 阿武隈改, 金剛改二, 摩耶改, 熊野改, 大鳳改, 加賀改], ... }
    # def names
    #   @start.each do |start_json_file|
    #     start = JSON::parse(start_json_file)

    #     start
    #   end
    # end
  end
end
