# -*- coding: utf-8 -*-
## 艦娘の情報が入ってるクラス

module Kancolle
  class Kanmusu
    @@kanmusu_names = {
      1=>'電改',6=>'若葉改',10=>'菊月改',13=>'綾波改二',15=>'文月改',16=>'子日改',25=>'川内改二',26=>'如月改',27=>'三日月改',
      28=>'皐月改',35=>'羽黒改二',37=>'初霜改',38=>'時雨改二',44=>'神通改二',45=>'那珂改二',46=>'木曾改二',49=>'赤城改',
      51=>'由良改',52=>'磯波改',55=>'北上改二',60=>'夕立改二',70=>'長月改',74=>'暁改',79=>'球磨改',129=>'望月改',137=>'多摩改',
      150=>'千代田航改二',158=>'霧島改二',164=>'長良改',194=>'龍驤改二',233=>'叢雲改',267=>'雷改',341=>'摩耶改',345=>'古鷹改',
      355=>'名取改',361=>'飛鷹改',362=>'大井改二',370=>'愛宕改',379=>'隼鷹改',391=>'鳳翔改',421=>'扶桑改',451=>'山城改',
      452=>'利根改二',460=>'加賀改',469=>'最上改',488=>'祥鳳改',509=>'榛名改二',518=>'比叡改二',568=>'島風改',627=>'千歳航改二',
      639=>'霞改',661=>'睦月改',726=>'伊勢改',840=>'日向改',905=>'夕張改',1245=>'吹雪改',1275=>'瑞鳳改',1282=>'伊168改',
      1401=>'漣改',1500=>'陸奥改',1794=>'鈴谷改',1803=>'伊58改',1812=>'衣笠改二',1822=>'阿武隈改',1845=>'鬼怒改',
      1847=>'阿武隈',1899=>'舞風改',1949=>'蒼龍改二',1969=>'阿武隈改',1979=>'阿武隈改',2070=>'熊野改',2125=>'Верный',
      2162=>'大和改',2189=>'金剛改二',2353=>'五月雨改',2596=>'阿武隈',2783=>'翔鶴改',2935=>'潮改',2948=>'阿武隈',
      2964=>'飛龍改二',2981=>'陽炎改',3182=>'阿武隈',3199=>'涼風改',3232=>'阿武隈',3266=>'阿武隈',3402=>'阿武隈',
      3441=>'阿武隈',3715=>'阿武隈',4874=>'白露改',5720=>'長門改',5818=>'阿武隈',6175=>'初風改',6596=>'雪風改',
      6914=>'秋雲改',7064=>'五十鈴改二',8087=>'千歳甲',8105=>'千代田甲',8335=>'三隈改',9623=>'村雨改',
      10123=>'巻雲改',11357=>'伊19改',11406=>'能代',11630=>'伊8改',11780=>'武蔵改',12110=>'大鳳改',12136=>'あきつ丸改',
      12192=>'初春改',12203=>'曙改',12333=>'長波改',12355=>'伊401改',12662=>'瑞鶴改',13152=>'弥生改',13514=>'まるゆ改',
      13576=>'阿賀野',13609=>'夕雲改',14480=>'卯月改',15636=>'矢矧改',16163=>'Z1 zwei',19536=>'伊8',
      19774=>'明石改',19775=>'筑摩改二',19799=>'天津風改',20044=>'酒匂',20209=>'伊58',20214=>'伊8',
      20580=>'伊19',21073=>'浜風改',21664=>'谷風改',22230=>'Z3改',22940=>'伊19',22965=>'伊58',
      23007=>'Bismarck改',23328=>'浦風改',23977=>'妙高改二',23978=>'那智改',24518=>'龍鳳改',24724=>'大鯨',
      24819=>'まるゆ',26008=>'高雄改',28178=>"伊19",28417=>"伊8"
    }
    @@port_kanmusu_iti = {
      1=>0,6=>1,10=>2,13=>3,15=>4,16=>5,25=>6,26=>7,27=>8,28=>9,35=>10,37=>11,38=>12,44=>13,45=>14,
      46=>15,49=>16,51=>17,52=>18,55=>19,60=>20,70=>21,74=>22,79=>23,129=>24,137=>25,150=>26,
      158=>27,164=>28,194=>29,233=>30,267=>31,341=>32,345=>33,355=>34,361=>35,362=>36,370=>37,
      379=>38,391=>39,421=>40,451=>41,452=>42,460=>43,469=>44,488=>45,509=>46,518=>47,568=>48,
      627=>49,639=>50,661=>51,726=>52,840=>53,905=>54,1245=>55,1275=>56,1282=>57,1401=>58,1500=>59,
      1794=>60,1803=>61,1812=>62,1822=>63,1845=>64,1847=>65,1899=>66,1949=>67,1969=>68,1979=>69,
      2070=>70,2125=>71,2162=>72,2189=>73,2353=>74,2596=>75,2783=>76,2935=>77,2948=>78,2964=>79,
      2981=>80,3182=>81,3199=>82,3232=>83,3266=>84,3402=>85,3441=>86,3715=>87,4874=>88,5720=>89,
      5818=>90,6175=>91,6596=>92,6914=>93,7064=>94,8087=>95,8105=>96,8335=>97,9623=>98,9783=>99,
      10123=>100,11357=>101,11406=>102,11630=>103,11780=>104,12110=>105,12136=>106,12192=>107,
      12203=>108,12333=>109,12355=>110,12662=>111,13152=>112,13514=>113,13576=>114,13609=>115,
      14480=>116,15636=>117,16163=>118,17392=>119,19536=>120,19774=>121,19775=>122,19799=>123,
      20044=>124,20209=>125,20214=>126,20345=>127,20580=>128,21073=>129,21664=>130,22230=>131,
      22940=>132,22965=>133,23007=>134,23328=>135,23977=>136,23978=>137,24518=>138,24724=>139,
      24819=>140
    }
    @@dir_names = [ "/Users/shirokuro11/Documents/航海日誌アーカイブ/5-23",
                    "/Users/shirokuro11/Documents/航海日誌アーカイブ/6-14",
                    "/Users/shirokuro11/Documents/航海日誌アーカイブ/6-24",
                    "/Users/shirokuro11/Documents/航海日誌アーカイブ/7-04",
                    "/Users/shirokuro11/Documents/航海日誌アーカイブ/7-14",
                    "/Users/shirokuro11/Documents/航海日誌アーカイブ/7-18",
                    "/Users/shirokuro11/Documents/航海日誌アーカイブ/7-28",
                    "/Users/shirokuro11/Documents/koukai_nisshi/data/json/json"
                  ]

    @@port_kanmusu_iti_last_id = 24819
    def self.port_kanmusu_iti(id)
      @@port_kanmusu_iti[id]
    end
    def self.port_kanmusu_iti_push(id, n)
      @@port_kanmusu_iti[id] = n
      if id > @@port_kanmusu_iti.keys.sort.last
        @@port_kanmusu_iti_last_id = n
      end
    end
    def self.port_kanmusu_iti_last_id
      @@port_kanmusu_iti_last_id
    end
    def self.start2_slot_iti
      {20=>"改良型艦本式タービン", 277=>"61cm四連装(酸素)魚雷", 278=>"61cm四連装(酸素)魚雷", 377=>"10cm連装高角砲", 381=>"10cm連装高角砲", 385=>"甲標的", 390=>"21号対空電探", 391=>"61cm四連装(酸素)魚雷", 428=>"10cm連装高角砲", 457=>"甲標的", 568=>"61cm四連装(酸素)魚雷", 641=>"15.5cm三連装副砲", 648=>"61cm四連装(酸素)魚雷", 649=>"61cm四連装(酸素)魚雷", 781=>"彩雲", 822=>"10cm連装高角砲", 864=>"61cm四連装(酸素)魚雷", 926=>"10cm連装高角砲", 941=>"21号対空電探", 942=>"61cm四連装(酸素)魚雷", 951=>"61cm四連装(酸素)魚雷", 997=>"10cm連装高角砲", 998=>"61cm四連装(酸素)魚雷", 1040=>"21号対空電探", 1041=>"61cm四連装(酸素)魚雷", 1047=>"15.5cm三連装副砲", 1162=>"甲標的", 1163=>"甲標的", 1204=>"12cm30連装噴進砲", 1209=>"61cm四連装(酸素)魚雷", 1216=>"61cm四連装(酸素)魚雷", 1319=>"21号対空電探", 1483=>"10cm連装高角砲", 1484=>"61cm四連装(酸素)魚雷", 1493=>"10cm連装高角砲", 1645=>"12cm30連装噴進砲", 1651=>"瑞雲", 1929=>"33号対水上電探", 1986=>"彩雲", 2005=>"41cm連装砲", 2006=>"15.5cm三連装副砲", 2055=>"彗星", 2098=>"12cm30連装噴進砲", 2194=>"彗星", 2249=>"41cm連装砲", 2341=>"61cm五連装(酸素)魚雷", 2355=>"瑞雲", 2394=>"12cm30連装噴進砲", 2502=>"41cm連装砲", 2647=>"瑞雲", 3023=>"61cm四連装(酸素)魚雷", 3104=>"応急修理女神", 3108=>"46cm三連装砲", 3109=>"15.5cm三連装副砲", 3127=>"烈風", 3415=>"21号対空電探", 3416=>"61cm四連装(酸素)魚雷", 3491=>"46cm三連装砲", 3507=>"甲標的", 3508=>"甲標的", 4226=>"彩雲", 4489=>"15.5cm三連装副砲", 4546=>"10cm連装高角砲", 4557=>"10cm連装高角砲", 4573=>"41cm連装砲", 4689=>"10cm連装高角砲", 4696=>"10cm連装高角砲", 4699=>"15.5cm三連装副砲", 4841=>"10cm連装高角砲", 4854=>"10cm連装高角砲", 4945=>"10cm連装高角砲", 5051=>"10cm連装高角砲", 5135=>"流星改", 5432=>"烈風", 5653=>"10cm連装高角砲", 5678=>"32号対水上電探", 5697=>"10cm連装高角砲", 5838=>"32号対水上電探", 5839=>"三式弾", 5893=>"10cm連装高角砲", 5901=>"10cm連装高角砲", 5973=>"10cm連装高角砲", 5974=>"14号対空電探", 6254=>"三式弾", 6258=>"三式弾", 6260=>"14号対空電探", 6482=>"10cm連装高角砲", 6486=>"10cm連装高角砲", 6506=>"12cm30連装噴進砲", 6531=>"46cm三連装砲", 6764=>"瑞雲", 6813=>"61cm五連装(酸素)魚雷", 6954=>"甲標的", 6957=>"15.5cm三連装副砲", 7194=>"10cm連装高角砲", 7325=>"流星改", 7525=>"41cm連装砲", 7823=>"10cm連装高角砲", 7929=>"流星改", 8027=>"61cm四連装(酸素)魚雷", 8045=>"甲標的", 8193=>"10cm連装高角砲", 8194=>"61cm四連装(酸素)魚雷", 8202=>"10cm連装高角砲", 8203=>"61cm四連装(酸素)魚雷", 8243=>"15.5cm三連装副砲", 8256=>"九一式徹甲弾", 8257=>"三式弾", 8261=>"三式弾", 8262=>"三式弾", 8264=>"三式弾", 8411=>"応急修理要員", 8553=>"41cm連装砲", 8557=>"甲標的", 8587=>"41cm連装砲", 8681=>"10cm連装高角砲", 8691=>"九一式徹甲弾", 9040=>"彗星一二型甲", 9115=>"10cm連装高角砲", 9116=>"61cm四連装(酸素)魚雷", 9124=>"15.5cm三連装副砲", 9176=>"烈風", 9289=>"41cm連装砲", 9564=>"13号対空電探", 9566=>"33号対水上電探", 9618=>"14号対空電探", 9620=>"13号対空電探", 9807=>"10cm連装高角砲", 9851=>"10cm連装高角砲", 9852=>"61cm四連装(酸素)魚雷", 9853=>"46cm三連装砲", 9854=>"15.5cm三連装副砲", 9961=>"試製晴嵐", 9962=>"20.3cm(3号)連装砲", 9966=>"10cm連装高角砲", 9998=>"46cm三連装砲", 9999=>"46cm三連装砲", 10071=>"10cm連装高角砲", 10095=>"三式水中探信儀", 10299=>"46cm三連装砲", 10487=>"10cm連装高角砲", 10555=>"33号対水上電探", 10572=>"46cm三連装砲", 10645=>"21号対空電探", 10865=>"10cm連装高角砲", 10866=>"61cm四連装(酸素)魚雷", 11327=>"61cm四連装(酸素)魚雷", 11329=>"61cm四連装(酸素)魚雷", 11388=>"応急修理要員", 11515=>"10cm連装高角砲", 12018=>"甲標的", 12035=>"甲標的", 12074=>"33号対水上電探", 12128=>"20.3cm連装砲", 12952=>"彗星一二型甲", 13131=>"61cm四連装(酸素)魚雷", 13147=>"彗星一二型甲", 13342=>"試製晴嵐", 13398=>"彗星一二型甲", 13742=>"三式弾", 13788=>"12.7cm連装砲B型改二", 14069=>"瑞雲", 14120=>"20.3cm(3号)連装砲", 14482=>"流星改", 14552=>"三式水中探信儀", 14640=>"流星改", 14827=>"彗星", 14828=>"流星改", 15120=>"三式爆雷投射機", 15129=>"20.3cm連装砲", 15240=>"彗星一二型甲", 15254=>"紫電改二", 15305=>"10cm連装高角砲", 15306=>"61cm四連装(酸素)魚雷", 15452=>"強化型艦本式缶", 15454=>"九一式徹甲弾", 15458=>"15.5cm三連装副砲", 15461=>"13号対空電探", 15463=>"32号対水上電探", 15467=>"三式弾", 15496=>"三式水中探信儀", 15583=>"三式弾", 15585=>"32号対水上電探", 15725=>"流星改", 15816=>"13号対空電探", 15977=>"33号対水上電探", 15979=>"32号対水上電探", 15981=>"13号対空電探", 16352=>"強化型艦本式缶", 16379=>"改良型艦本式タービン", 16474=>"流星", 16818=>"応急修理女神", 16905=>"8cm高角砲", 16950=>"応急修理女神", 16951=>"53cm艦首(酸素)魚雷", 17425=>"46cm三連装砲", 17426=>"15.5cm三連装副砲", 17851=>"二式艦上偵察機", 17852=>"Ju87C改", 17859=>"零式艦戦62型(爆戦)", 17888=>"試製晴嵐", 17895=>"九一式徹甲弾", 17896=>"41cm連装砲", 17907=>"大発動艇", 17920=>"応急修理要員", 18366=>"20.3cm連装砲", 18393=>"46cm三連装砲", 18476=>"烈風", 18477=>"流星", 18478=>"10cm連装高角砲(砲架)", 18690=>"応急修理要員", 18823=>"61cm四連装(酸素)魚雷", 18844=>"甲標的", 18982=>"三式指揮連絡機(対潜)", 18983=>"カ号観測機", 18994=>"61cm五連装(酸素)魚雷", 18995=>"13号対空電探", 19024=>"15.5cm三連装副砲", 19084=>"41cm連装砲", 19125=>"彗星", 19126=>"12cm30連装噴進砲", 19165=>"試製晴嵐", 19214=>"61cm五連装(酸素)魚雷", 19327=>"21号対空電探", 19328=>"三式弾", 19353=>"Ju87C改", 19392=>"46cm三連装砲", 19394=>"22号対水上電探", 19414=>"14号対空電探", 19473=>"応急修理要員", 19506=>"20.3cm(3号)連装砲", 19532=>"33号対水上電探", 19718=>"32号対水上電探", 19949=>"三式水中探信儀", 20027=>"三式水中探信儀", 20105=>"8cm高角砲", 20336=>"三式水中探信儀", 20371=>"10cm連装高角砲", 20385=>"61cm五連装(酸素)魚雷", 20386=>"21号対空電探", 20459=>"41cm連装砲", 20581=>"彗星", 20590=>"10cm連装高角砲", 20592=>"10cm連装高角砲", 20593=>"61cm四連装(酸素)魚雷", 20694=>"三式水中探信儀", 20832=>"61cm四連装(酸素)魚雷", 20833=>"22号対水上電探", 21052=>"Ju87C改", 21745=>"探照灯", 21746=>"61cm四連装(酸素)魚雷", 21747=>"61cm四連装(酸素)魚雷", 21758=>"ドラム缶(輸送用)", 21759=>"ドラム缶(輸送用)", 21833=>"ドラム缶(輸送用)", 22137=>"ドラム缶(輸送用)", 22158=>"20.3cm連装砲", 22187=>"13号対空電探", 22465=>"大発動艇", 22814=>"三式指揮連絡機(対潜)", 22815=>"カ号観測機", 23120=>"15.2cm連装砲", 23121=>"8cm高角砲", 23122=>"ドラム缶(輸送用)", 23426=>"41cm連装砲", 23672=>"三式爆雷投射機", 23706=>"ドラム缶(輸送用)", 23879=>"12.7cm単装砲", 23919=>"瑞雲(六三四空)", 24643=>"ドラム缶(輸送用)", 25036=>"ドラム缶(輸送用)", 25042=>"ドラム缶(輸送用)", 25239=>"流星", 25240=>"彗星", 25469=>"瑞雲(六三四空)", 25651=>"ドラム缶(輸送用)", 25743=>"ドラム缶(輸送用)", 26057=>"ドラム缶(輸送用)", 26172=>"彗星", 26475=>"三式水中探信儀", 26548=>"流星", 26978=>"流星改", 27140=>"ドラム缶(輸送用)", 27158=>"ドラム缶(輸送用)", 27162=>"ドラム缶(輸送用)", 27227=>"瑞雲", 27416=>"12.7cm単装砲", 27420=>"彗星一二型甲", 27790=>"流星", 28069=>"15.2cm連装砲", 28194=>"烈風", 28196=>"零式艦戦62型(爆戦)", 28361=>"ドラム缶(輸送用)", 28369=>"瑞雲12型", 28370=>"20.3cm(3号)連装砲", 28563=>"20.3cm(3号)連装砲", 28565=>"瑞雲(六三四空)", 28592=>"烈風改", 28663=>"艦艇修理施設", 28706=>"強化型艦本式缶", 28720=>"零式艦戦62型(爆戦)", 28788=>"三式爆雷投射機", 28809=>"15.2cm連装砲", 28881=>"新型高温高圧缶", 28882=>"応急修理女神", 28883=>"艦艇修理施設", 29068=>"15.2cm連装砲", 29069=>"8cm高角砲", 29139=>"流星改", 29324=>"艦艇修理施設", 29531=>"流星改", 29533=>"彗星一二型甲", 29831=>"ドラム缶(輸送用)", 29855=>"ドラム缶(輸送用)", 29861=>"ドラム缶(輸送用)", 29864=>"ドラム缶(輸送用)", 29892=>"ドラム缶(輸送用)", 29928=>"61cm四連装(酸素)魚雷", 29929=>"三式水中探信儀", 29930=>"新型高温高圧缶", 29939=>"零式水上偵察機", 29968=>"61cm四連装(酸素)魚雷", 29969=>"零式水上偵察機", 30015=>"彗星一二型甲", 30021=>"20.3cm連装砲", 30162=>"零式水上偵察機", 30256=>"61cm四連装(酸素)魚雷", 30366=>"41cm連装砲", 30367=>"探照灯", 30368=>"21号対空電探", 30464=>"烈風", 30528=>"三式爆雷投射機", 30698=>"20.3cm連装砲", 30736=>"瑞雲", 30903=>"20.3cm連装砲", 30922=>"彗星一二型甲", 30987=>"61cm四連装(酸素)魚雷", 30999=>"21号対空電探", 31083=>"零式水上偵察機", 31397=>"2cm 四連装FlaK 38", 31398=>"12.7cm単装砲", 31404=>"ドラム缶(輸送用)", 31644=>"零式艦戦62型(爆戦)", 31650=>"彗星一二型甲", 31654=>"瑞雲", 31664=>"瑞雲", 31668=>"彗星一二型甲", 31680=>"瑞雲", 32110=>"12.7cm単装砲", 32423=>"ドラム缶(輸送用)", 32531=>"22号対水上電探改四", 32532=>"九七式艦攻(九三一空)", 32578=>"零式艦戦62型(爆戦)", 32632=>"41cm連装砲", 32664=>"ドラム缶(輸送用)", 32814=>"烈風", 32894=>"20.3cm連装砲", 33147=>"ドラム缶(輸送用)", 33177=>"38cm連装砲", 33178=>"15cm連装副砲", 33240=>"九九式艦爆", 33280=>"20.3cm連装砲", 33297=>"20.3cm連装砲", 33314=>"彗星", 33342=>"九九式艦爆", 33396=>"零式艦戦62型(爆戦)", 33398=>"二式艦上偵察機", 33399=>"20.3cm(2号)連装砲", 33400=>"20.3cm(2号)連装砲", 33401=>"22号対水上電探", 33402=>"20.3cm連装砲", 33455=>"彗星一二型甲", 33821=>"38cm連装砲", 33822=>"15cm連装副砲", 33826=>"瑞雲", 33832=>"22号対水上電探", 33897=>"ドラム缶(輸送用)", 33915=>"九九式艦爆", 33956=>"20.3cm連装砲", 33967=>"彗星", 33997=>"九九式艦爆", 34036=>"20.3cm(3号)連装砲", 34037=>"21号対空電探", 34038=>"瑞雲", 34291=>"41cm連装砲", 34347=>"烈風", 34414=>"彗星一二型甲", 34418=>"零式水上偵察機", 34547=>"20.3cm(3号)連装砲", 34548=>"21号対空電探", 34549=>"瑞雲(六三四空)", 34577=>"瑞雲", 34579=>"瑞雲", 34737=>"瑞雲", 34805=>"ドラム缶(輸送用)", 34871=>"零式艦戦62型(爆戦)", 34986=>"20.3cm(3号)連装砲", 34987=>"21号対空電探", 34988=>"瑞雲", 34992=>"41cm連装砲", 35049=>"瑞雲", 35223=>"41cm連装砲", 35432=>"41cm連装砲", 35488=>"20.3cm連装砲", 35489=>"61cm四連装(酸素)魚雷", 35493=>"61cm四連装(酸素)魚雷", 35498=>"三式爆雷投射機", 35514=>"毘式40mm連装機銃", 35541=>"増設バルジ(中型艦)", 35742=>"ドラム缶(輸送用)", 35770=>"零式艦戦21型(熟練)", 35771=>"九九式艦爆(熟練)", 35772=>"天山一二型(友永隊)", 35789=>"流星", 35833=>"12.7cm連装高角砲(後期型)", 35844=>"毘式40mm連装機銃", 35891=>"潜水艦53cm艦首魚雷(8門)", 35953=>"零式水上観測機", 36115=>"九九式艦爆", 36129=>"九九式艦爆", 36131=>"九九式艦爆", 36138=>"零式水上観測機", 36209=>"20.3cm連装砲", 36249=>"20.3cm連装砲", 36264=>"九七式艦攻(九三一空)", 36265=>"12cm30連装噴進砲", 36329=>"零式水上観測機", 36443=>"零式水上観測機", 36518=>"瑞雲12型", 36519=>"22号対水上電探改四", 36641=>"零式水上観測機", 36688=>"零式水上偵察機", 36849=>"零式水上観測機", 36855=>"ドラム缶(輸送用)", 36916=>"41cm連装砲", 36919=>"九一式徹甲弾", 36920=>"41cm連装砲", 36928=>"20.3cm連装砲", 36930=>"41cm連装砲", 36932=>"41cm連装砲", 36933=>"15.5cm三連装副砲", 36936=>"41cm連装砲", 36937=>"15.5cm三連装副砲", 36939=>"15.5cm三連装副砲", 36941=>"甲標的", 36942=>"46cm三連装砲", 36943=>"46cm三連装砲", 37025=>"零式水上観測機", 37042=>"瑞雲", 37043=>"瑞雲", 37048=>"彗星一二型甲", 37051=>"流星", 37074=>"12.7cm連装高角砲(後期型)", 37182=>"零式水上観測機", 37199=>"41cm連装砲", 37276=>"零式水上観測機", 37315=>"零式水上観測機", 37393=>"零式水上観測機", 37531=>"零式水上観測機", 37567=>"九三式水中聴音機", 37571=>"潜水艦53cm艦首魚雷(8門)", 37572=>"15.5cm三連装副砲", 37726=>"零式水上偵察機", 37823=>"ドラム缶(輸送用)", 37866=>"照明弾", 37867=>"探照灯", 37868=>"九八式水上偵察機(夜偵)", 37913=>"20.3cm連装砲"}
    end
    def self.start2_slot_iti_last_id
      37913
    end
    def self.kanmusu_names
      @@kanmusu_names
    end
    def self.kanmusu_names_push(id, name)
      @@kanmusu_names[id] = name
    end
    def self.dir
      @@dir_names
    end
  end
end
